import { MigrationInterface, QueryRunner } from 'typeorm';

export class InsertTopicsData1623586252086 implements MigrationInterface {
  public async up(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(`
            INSERT INTO topics (name, description) VALUES 
            ('Освіта', 'Ініціативи, що стосуються освіти та навчання'),
            ('Охорона здоров''я', 'Ініціативи, що спрямовані на покращення медичної допомоги та здорового способу життя'),
            ('Соціальна підтримка', 'Ініціативи, спрямовані на покращення соціального захисту та підтримки громадян'),
            ('Екологія', 'Ініціативи з охорони навколишнього середовища та збереження природних ресурсів'),
            ('Інфраструктура', 'Ініціативи, спрямовані на розвиток та покращення інфраструктури'),
            ('Культура та мистецтво', 'Ініціативи, що спрямовані на розвиток культури та мистецтва'),
            ('Економіка та бізнес', 'Ініціативи з підтримки економічного розвитку та підприємництва'),
            ('Транспорт', 'Ініціативи, спрямовані на розвиток транспортної системи та забезпечення зручностей у пересуванні'),
            ('Спорт та активний відпочинок', 'Ініціативи, спрямовані на підтримку спорту та здорового способу життя'),
            ('Демократія та права людини', 'Ініціативи, що спрямовані на захист прав та свобод громадян'),
            ('Житлове середовище', 'Ініціативи з покращення умов проживання та житлової інфраструктури'),
            ('Сільське господарство', 'Ініціативи з підтримки та розвитку сільського господарства'),
            ('Технології та інновації', 'Ініціативи, що спрямовані на впровадження технологій та інновацій у всі сфери життя'),
            ('Туризм', 'Ініціативи, спрямовані на розвиток туризму та приваблення туристів');
        `);
  }

  public async down(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(`DELETE FROM topics`);
  }
}
